


const BCss = () => {
    return (
        <div className=" mb-10 mt-10 ml-10 mr-10">

            <div>

                 

                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 01: সিউডো ক্লাস কি?
                         উত্তর: ছদ্ম-শ্রেণী হল ছদ্ম-উপাদানের প্রকার যা একটি সাধারণ নথি গাছে থাকে না। এটি নির্দিষ্ট শর্তের অধীনে নিয়মিত উপাদান নির্বাচন করার অনুমতি দেয় বিশেষ করে যখন আমরা লিঙ্কের উপর হভার করার চেষ্টা করি; অ্যাঙ্কর ট্যাগগুলি হল :link, :visited, :hover, :active, :focus
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 02: গ্রিড সিস্টেম কি?
                         উত্তরঃ CSS গ্রিড সিস্টেম হল এক ধরনের শক্তিশালী লেআউট যা কলাম এবং সারির ক্ষেত্রে 2 ডাইমেনশনাল সিস্টেমের।
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 03 : সিএসএস গ্রিড বনাম ফ্লেক্সবক্সের মধ্যে পার্থক্য?
                         উত্তর: CSS গ্রিড লেআউট হল সারি এবং কলাম সহ একটি দ্বি-মাত্রিক সিস্টেম। এটি বড় আকারের লেআউটের জন্য ব্যবহৃত হয়। ফ্লেক্সবক্স হল একটি গ্রিড লেআউট যার একটি এক-মাত্রিক সিস্টেম হয় একটি সারি বা একটি কলামের মধ্যে। এটি একটি অ্যাপ্লিকেশনের উপাদানগুলির জন্য ব্যবহৃত হয়।
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 04: CSS কি এবং এটি কিভাবে HTML থেকে আলাদা?
                         উত্তরঃ CSS মানে ক্যাসকেডিং স্টাইল শীট। এটি একটি স্টাইল শীট ভাষা যা HTML এ লেখা একটি নথির চেহারা এবং বিন্যাস বর্ণনা করার জন্য ব্যবহৃত হয়। যদিও HTML একটি নথির গঠন সংজ্ঞায়িত করে, CSS এর উপস্থাপনার জন্য দায়ী।
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 05 : CSS-এ বক্স মডেল ব্যাখ্যা কর।
                         উত্তর: CSS বক্স মডেলটি মূলত একটি বক্স যা প্রতিটি HTML উপাদানকে ঘিরে থাকে। এতে রয়েছে: বিষয়বস্তু, প্যাডিং, সীমানা এবং মার্জিন
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 06: ইনলাইন এবং ব্লক-স্তরের উপাদানগুলির মধ্যে পার্থক্য কী?
                         উত্তর : একটি ব্লক-স্তরের উপাদান সর্বদা একটি নতুন লাইনে শুরু হয় এবং ব্রাউজারগুলি স্বয়ংক্রিয়ভাবে উপাদানের আগে এবং পরে কিছু স্থান (একটি মার্জিন) যোগ করে। একটি ইনলাইন উপাদান একটি নতুন লাইন শুরু হয় না. একটি ইনলাইন উপাদান শুধুমাত্র প্রয়োজনীয় যতটা প্রস্থ নেয়।
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 07: z-সূচক সম্পত্তির উদ্দেশ্য কী?
                         উত্তর: Z-index একটি পৃষ্ঠায় ওভারল্যাপিং উপাদানগুলির স্ট্যাকিং ক্রম নিয়ন্ত্রণ করে। একটি উচ্চ z-সূচক মান সহ একটি উপাদান একটি নিম্ন z-সূচক মান সহ একটি উপাদানের সামনে উপস্থিত হবে৷
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 08 : আপেক্ষিক, পরম এবং স্থির অবস্থানের মধ্যে পার্থক্য ব্যাখ্যা কর।
                          উত্তর: আপেক্ষিক - উপাদানটি তার স্বাভাবিক অবস্থানের সাথে তুলনা করে। পরম - উপাদানটি একেবারে তার প্রথম অবস্থানকারী অভিভাবকের কাছে অবস্থিত। স্থির - উপাদানটি ব্রাউজার উইন্ডোর সাথে সম্পর্কিত।
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 09: কিভাবে CSS নির্দিষ্টতা শ্রেণিবিন্যাস কাজ করে?
                         উত্তর : যদি একই উপাদানের দিকে নির্দেশ করে এমন দুই বা ততোধিক CSS নিয়ম থাকে, তাহলে সর্বোচ্চ নির্দিষ্টতার মান সহ নির্বাচক "জিতবে"।
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 10: CSS-এ মিডিয়া প্রশ্নের উদ্দেশ্য কী?
                         উত্তর: মিডিয়া প্রশ্ন হল প্রতিক্রিয়াশীল ওয়েব ডিজাইনের একটি মূল অংশ।
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 11 : প্যাডিং এবং মার্জিনের মধ্যে পার্থক্য ব্যাখ্যা কর।
                         উত্তর: প্যাডিং হল একটি উপাদানের ভিতরের বিষয়বস্তু এবং তার সীমানার মধ্যবর্তী স্থান, আর মার্জিন হল উপাদানের বাইরে, তার সীমানা এবং অন্যান্য উপাদানের মধ্যবর্তী স্থান।
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 11 : প্যাডিং এবং মার্জিনের মধ্যে পার্থক্য ব্যাখ্যা কর।
                         উত্তরঃ যে HTML এলিমেন্টে ক্লোজিং ট্যাগ নেই বা বন্ধ করার প্রয়োজন নেই সেগুলো হল Void উপাদান। যেমন br, hr, img, input ইত্যাদি।
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 12: আপনি কিভাবে একটি উপাদানকে CSS-এ অনুভূমিকভাবে এবং উল্লম্বভাবে কেন্দ্র করবেন?
                         উত্তর: অনুভূমিক কেন্দ্রীকরণের জন্য `টেক্সট-সারিবদ্ধ: কেন্দ্র` এবং উল্লম্ব কেন্দ্রীকরণের জন্য ফ্লেক্সবক্স বা গ্রিড।
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 13: CSS ফ্লোট সম্পত্তি সম্পর্কে আমাদের বলুন।
                          উত্তর: CSS-এর ফ্লোট প্রপার্টি একটি ইমেজকে প্রয়োজন অনুযায়ী ডান বা বামে অবস্থান করে, এর চারপাশে টেক্সট মোড়ানো সহ। এটির আগে ব্যবহৃত উপাদানগুলির সমস্ত বৈশিষ্ট্য অপরিবর্তিত থাকে
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 14 : CSS-এ গ্রেডিয়েন্টের সংজ্ঞা দাও।
                         উত্তর: CSS এর একটি বৈশিষ্ট্য যা দুই বা ততোধিক নির্দিষ্ট রঙের মধ্যে মসৃণ রূপান্তর প্রদর্শনের অনুমতি দেয়। গ্রেডিয়েন্টের ধরন রৈখিক এবং রেডিয়াল। 
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 15: ফ্লেক্সবক্সের বৈশিষ্ট্যগুলি কী কী?
                         উত্তর: ফ্লেক্সবক্সের বৈশিষ্ট্যগুলি হল ফ্লেক্স-দিক, মোড়ানো, প্রবাহ, বিষয়বস্তু এবং সারিবদ্ধ-আইটেম এবং বিষয়বস্তু
                         </p>
                         <br></br>

















            </div>
            
        </div>
    );
};

export default BCss;