



const Bhtml = () => {
    return (
        <div className=" mb-10 mt-10 ml-10 mr-10">
            <div>


                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 01: এইচটিএমএল-এ অকার্যকর উপাদানগুলি কী কী?
                         উত্তরঃ এইচটিএমএল এলিমেন্ট যেগুলোর ক্লোজিং ট্যাগ নেই বা বন্ধ করার প্রয়োজন নেই
                         অকার্যকর উপাদান। যেমন br / , hr /, img /, input / ইত্যাদি।
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 02: এইচটিএমএল এর 'আইডি' অ্যাট্রিবিউট এবং 'ক্লাস' অ্যাট্রিবিউটের মধ্যে পার্থক্য কী?
                         উপাদান?
                         উত্তর : এইচটিএমএল-এ একাধিক উপাদানের একই শ্রেণির মান থাকতে পারে, যেখানে আইডির মান
                         একটি উপাদানের বৈশিষ্ট্য অন্য HTML উপাদানের সাথে যুক্ত করা যাবে না।
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 03: লিঙ্ক ট্যাগ link এবং অ্যাঙ্কর ট্যাগ a এর মধ্যে পার্থক্য?
                         উত্তর : অ্যাঙ্কর ট্যাগ a অন্য ওয়েবপেজ বা a-তে হাইপারলিঙ্ক তৈরি করতে ব্যবহৃত হয়
                         ওয়েবপৃষ্ঠার নির্দিষ্ট অংশ এবং এই লিঙ্কগুলি ক্লিকযোগ্য, যেখানে লিঙ্ক ট্যাগ link
                         একটি নথি এবং একটি বহিরাগত সম্পদের মধ্যে একটি লিঙ্ক সংজ্ঞায়িত করে এবং এগুলি নয়
                         ক্লিকযোগ্য
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 04: HTML-এ ট্যাগ এবং বৈশিষ্ট্যগুলি কী কী?
                         উত্তর: ট্যাগ হল HTML এর প্রাথমিক উপাদান যা বিষয়বস্তু কেমন হবে তা নির্ধারণ করে
                        কাঠামোবদ্ধ / বিন্যাসিত। যেমন, h1/ /p, p ইত্যাদি ট্যাগ। যেখানে গুণাবলী হয়
                        উপাদানটির বৈশিষ্ট্য নির্ধারণ করতে HTML ট্যাগের সাথে ব্যবহার করা হয়। জন্য
                        উদাহরণস্বরূপ, সাক্ষাৎকারের প্রশ্নগুলি, এতে 'সারিবদ্ধ' হল
                        অ্যাট্রিবিউট যা ব্যবহার করে আমরা অনুচ্ছেদটিকে সারিবদ্ধ করব এর কেন্দ্রে দেখানোর জন্য
                        দেখুন
                         </p>
                         <br></br>
                         <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                         প্রশ্ন 05: শব্দার্থিক HTML কি?
                             উত্তরঃ শব্দার্থিক HTML হল একটি কোডিং স্টাইল। এটি শক্তিশালী করার জন্য এইচটিএমএল মার্কআপের ব্যবহার
                         শব্দার্থবিদ্যা বা বিষয়বস্তুর অর্থ। যেমন: শব্দার্থিক HTML এ b/b
                         ট্যাগ যেমন বোল্ড স্টেটমেন্টের জন্য ব্যবহার করা হয় না তেমনি i i ট্যাগ ইটালিকের জন্য ব্যবহার করা হয়।
                         এগুলোর পরিবর্তে আমরা স্ট্রং/স্ট্রং এবং em/em ট্যাগ ব্যবহার করি।
                         </p>
                         <br></br>














            </div>

            
        </div>
    );
};

export default Bhtml;