


const BReact = () => {
    return (
        <div className=" mb-10 mt-10 ml-10 mr-10">
            <div>
                
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 01: প্রতিক্রিয়া কি? উত্তর: প্রতিক্রিয়া হল একটি ফ্রন্ট-এন্ড জাভাস্ক্রিপ্ট লাইব্রেরি যা একক-পৃষ্ঠার অ্যাপ্লিকেশন তৈরির জন্য ব্যবহৃত হয়।
                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 02: JSX কি? উত্তর: JSX মানে JavaScript XML, এবং এটি আমাদেরকে জাভাস্ক্রিপ্ট ফাইলের ভিতরে HTML-এর মতো মার্কআপ লিখতে দেয়।

                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 03: প্রতিক্রিয়ায় রাষ্ট্র কী? উত্তর: রাষ্ট্র এমন একটি বস্তু যা কিছু তথ্য ধারণ করে যা একটি উপাদানের জীবদ্দশায় পরিবর্তিত হতে পারে।

                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 04: প্রতিক্রিয়াতে প্রপস কি? উত্তর: প্রপস হল একক মান বা বস্তু। এটি একটি উপাদান থেকে অন্য উপাদানে ডেটা প্রেরণের জন্য ব্যবহৃত হয়।

                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 05: কেন আমাদের সরাসরি রাজ্য আপডেট করা উচিত নয়? উত্তর: যদি আমরা সরাসরি স্টেট আপডেট করি তাহলে এটি কম্পোনেন্টকে রি-রেন্ডার করবে না।

                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 06: "কী" প্রপ কী এবং উপাদানগুলির অ্যারেতে এটি ব্যবহার করার সুবিধা কী? উত্তর: যখন আমরা ডেটা রেন্ডার করার জন্য মানচিত্র পদ্ধতি ব্যবহার করি তখন "কী" প্রপ ব্যবহার করা হয়। "কী" প্রপ কোন আইটেমগুলি পরিবর্তিত হয়েছে, যোগ করা হয়েছে বা সরানো হয়েছে তা সনাক্ত করতে সাহায্য করে।

                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 07: ভার্চুয়াল DOM কি? উত্তর: ভার্চুয়াল DOM(VDOM) হল এমন একটি ধারণা যেখানে একটি UI এর আদর্শ, বা 'ভার্চুয়াল' উপস্থাপনা মেমরিতে রাখা হয় এবং "বাস্তব" DOM-এর সাথে সিঙ্ক করা হয়।

                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 08: ভার্চুয়াল DOM কিভাবে কাজ করে? উত্তর: যখনই ডেটা পরিবর্তন হয়, সমগ্র UI পুনরায় রেন্ডার করা হয়। তারপরে পূর্ববর্তী DOM উপস্থাপনা এবং নতুনটির মধ্যে পার্থক্য গণনা করা হয়। একবার গণনা করা হয়ে গেলে, প্রকৃত DOM শুধুমাত্র পরিবর্তন করা জিনিসগুলির সাথে আপডেট করা হবে।

                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 09: উপাদান জীবনচক্রের বিভিন্ন পর্যায়গুলি কী কী? উত্তর: উপাদান জীবনচক্রের তিনটি ভিন্ন পর্যায় রয়েছে। সেগুলি হল: মাউন্ট করা, আপডেট করা এবং আনমাউন্ট করা।

                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 10: প্রসঙ্গ কি? উত্তর: কনটেক্সট প্রতিটি স্তরে ম্যানুয়ালি প্রপস ডাউন না করে কম্পোনেন্ট ট্রির মাধ্যমে ডেটা পাস করার একটি উপায় প্রদান করে

                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 11 : বিক্রিয়ায় নিয়ন্ত্রিত এবং অনিয়ন্ত্রিত উপাদানগুলি কী কী? উত্তর: নিয়ন্ত্রিত উপাদানগুলি হল যেগুলির ফর্ম উপাদানগুলি বিক্রিয়া অবস্থা দ্বারা নিয়ন্ত্রিত হয়। অনিয়ন্ত্রিত উপাদানগুলি হল সেগুলি যেখানে ফর্ম ডেটা DOM নিজেই পরিচালনা করে।
                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 12: রাষ্ট্রীয় এবং রাষ্ট্রহীন উপাদান কি? উত্তর: যদি একটি উপাদানের আচরণ উপাদানটির অবস্থার উপর নির্ভর করে তবে এটিকে রাষ্ট্রীয় উপাদান বলা যেতে পারে, এবং যদি একটি উপাদানের আচরণ তার অবস্থা থেকে স্বাধীন হয় তবে এটি একটি রাষ্ট্রহীন উপাদান হতে পারে।
                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 13: প্রতিক্রিয়াতে ইফেক্ট হুকের উদ্দেশ্য কী? উত্তর: useEffect হল একটি হুক যা কার্যকরী উপাদানগুলিতে পার্শ্ব প্রতিক্রিয়া সম্পাদন করে।

                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 14 : প্রতিক্রিয়া রাউটারের ধারণা এবং এর মূল উপাদানগুলি ব্যাখ্যা করুন। উত্তর: রিঅ্যাক্ট রাউটার হল রিঅ্যাক্ট অ্যাপ্লিকেশনে নেভিগেশন পরিচালনা করার জন্য একটি লাইব্রেরি। মূল উপাদানগুলির মধ্যে রয়েছে BrowserRouter, Route, এবং Link, NavLink।

                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 15: Redux কি, এবং আপনি কখন এটি একটি প্রতিক্রিয়া অ্যাপ্লিকেশনে ব্যবহার করবেন? উত্তর: Redux হল জাভাস্ক্রিপ্ট অ্যাপ্লিকেশনের জন্য একটি রাষ্ট্রীয় ব্যবস্থাপনা লাইব্রেরি। এটি ব্যবহার করা হয় যখন একটি অ্যাপ্লিকেশনের অবস্থা জটিল হয়ে যায় এবং একাধিক উপাদানের মধ্যে ভাগ করার প্রয়োজন হয়।
                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 16: প্রতিক্রিয়া এবং প্রতিক্রিয়ার মধ্যে পার্থক্য কী? উত্তর: প্রতিক্রিয়া ব্যবহারকারী ইন্টারফেসের জন্য তৈরি করা হয় এবং ReactDOM প্রতিক্রিয়াকে DOM-এর সাথে যোগাযোগ করতে দেয়।
                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 17: কেন আমরা প্রতিক্রিয়াতে প্রপস আপডেট করতে পারি না? উত্তর: প্রপগুলি অপরিবর্তনীয় এবং উপরে-নিচে হওয়া উচিত। এর মানে হল যে একজন অভিভাবক একটি সন্তানকে যেকোন প্রপ মান পাঠাতে পারেন, কিন্তু শিশু প্রাপ্ত প্রপস পরিবর্তন করতে পারে না।

                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 18: প্রতিক্রিয়াতে ফর্মগুলি কীভাবে পরিচালনা করবেন? এই প্রসঙ্গে নিয়ন্ত্রিত এবং অনিয়ন্ত্রিত উপাদানগুলি আলোচনা করুন। উত্তর: একটি নিয়ন্ত্রিত উপাদানে, ফর্ম ডেটা একটি প্রতিক্রিয়া উপাদান দ্বারা পরিচালিত হয়, এবং অনিয়ন্ত্রিত উপাদানগুলি DOM নিজেই পরিচালনা করে।

                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 19 : প্রতিক্রিয়াতে হুকগুলি কী কী? উত্তর: হুকগুলি ফাংশন উপাদানগুলিকে স্টেট এবং অন্যান্য প্রতিক্রিয়া বৈশিষ্ট্যগুলিতে অ্যাক্সেস করার অনুমতি দেয়।

                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 20 : প্রতিক্রিয়াতে কার্যকরী উপাদান এবং শ্রেণি উপাদানগুলির মধ্যে পার্থক্যগুলি আলোচনা কর। উত্তর: কার্যকরী উপাদানগুলি সহজ, রাষ্ট্রহীন এবং হুক ব্যবহার করে। ক্লাসের উপাদানগুলির একটি সম্পূর্ণ জীবনচক্র রয়েছে, স্থানীয় অবস্থা থাকতে পারে এবং ক্লাস সিনট্যাক্স ব্যবহার করতে পারে।

                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 21: প্রতিক্রিয়ায় useState কি? উত্তর: useState হল React Hook যা আমাদের কম্পোনেন্টে একটি স্টেট ভেরিয়েবল যোগ করতে দেয়। এটি দুটি মান সহ একটি অ্যারে প্রদান করে। বর্তমান অবস্থা এবং এটি আপডেট করার জন্য একটি কার্যকরী অবস্থা।


                         </p>
                         <br></br>
                        <p className=" mt-10  bg-[#30bdaa] p-3 rounded-xl text-xl font-bold">
                        প্রশ্ন 22: প্রতিক্রিয়ায় ইউজমেমো কী? উত্তর: useMemo হল একটি React Hook যা আপনাকে রি-রেন্ডারের মধ্যে একটি গণনার ফলাফল ক্যাশে করতে দেয়।
                         </p>
                         <br></br>



            </div>
            
        </div>
    );
};

export default BReact;